Revit 2027 API
FamilyInstanceCreationData(XYZ, FamilySymbol, Element, StructuralType) Constructor
Initializes a new instance of the FamilyInstanceCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData(
	XYZ location,
	FamilySymbol symbol,
	Element host,
	StructuralType structuralType
)
Public Sub New (
	location As XYZ,
	symbol As FamilySymbol,
	host As Element,
	structuralType As StructuralType
)
public:
FamilyInstanceCreationData(
	XYZ^ location,
	FamilySymbol^ symbol,
	Element^ host,
	StructuralType structuralType
)
new :
        location : XYZ *
        symbol : FamilySymbol *
        host : Element *
        structuralType : StructuralType -> FamilyInstanceCreationData
Parameters
location XYZ
 The physical location where the instance is to be placed.
symbol FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
host Element
 The object into which the FamilyInstance is to be inserted, often known as the host.
structuralType StructuralType
 If structural then specify the type of the component.
See Also
Reference
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace